"""
🔧 Название: 🤖 Авто-Генератор Тест-Кейсов Telegram-бот 
👤 Автор: Metiso4kas
📅 Июнь 2025
💼 Назначение: Telegram юот для автоматического ии создания тест-кейсов
🛡 Лицензия: MIT

## 📜 Отказ от ответственности

- 🛠️ Данный проект создан исключительно для учебных и ознакомительных целей.
- 👤 Автор проекта не несёт ответственности за любые последствия использования этого инструмента.
- ❌ Коммерческое использование запрещена."

📢 Отказ от связи с Telegram

Данный проект является неофициальным и не аффилирован с Telegram.  
Telegram и логотип Telegram являются зарегистрированными товарными знаками их правообладателей.  
Проект использует открытое Telegram Bot API согласно [официальной документации](https://core.telegram.org/bots/api).
Он не является официальным продуктом Telegram Inc.

"""
BOT_TOKEN = "Здесь ваш токен"
OLLAMA_URL = "http://localhost:11434/api/generate"
OLLAMA_MODEL = 'deepseek-r1:8b'
